{
    "_name_or_path": "/content/drive/MyDrive/memoire/skin_disease_vit_model",
    "architectures": [
        "ViTForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "encoder_stride": 16,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "id2label": {
        "0": "Acne",
        "1": "Actinic Keratosis",
        "2": "Benign Tumors",
        "3": "Bullous",
        "4": "Candidiasis",
        "5": "Drug Eruption",
        "6": "Eczema",
        "7": "Infestations Bites",
        "8": "Lichen",
        "9": "Lupus",
        "10": "Moles",
        "11": "Psoriasis",
        "12": "Rosacea",
        "13": "Seborrh Keratoses",
        "14": "Skin Cancer",
        "15": "Sun Sunlight Damage",
        "16": "Tinea",
        "17": "Unknown Normal",
        "18": "Vascular Tumors",
        "19": "Vasculitis",
        "20": "Vitiligo",
        "21": "Warts"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
        "Acne": 0,
        "Actinic Keratosis": 1,
        "Benign Tumors": 2,
        "Bullous": 3,
        "Candidiasis": 4,
        "Drug Eruption": 5,
        "Eczema": 6,
        "Infestations Bites": 7,
        "Lichen": 8,
        "Lupus": 9,
        "Moles": 10,
        "Psoriasis": 11,
        "Rosacea": 12,
        "Seborrh Keratoses": 13,
        "Skin Cancer": 14,
        "Sun Sunlight Damage": 15,
        "Tinea": 16,
        "Unknown Normal": 17,
        "Vascular Tumors": 18,
        "Vasculitis": 19,
        "Vitiligo": 20,
        "Warts": 21
    },
    "layer_norm_eps": 1e-12,
    "model_type": "vit",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.48.3"
}